Autodesk.Revit.UI.DockablePaneId.op_Inequality(Autodesk.Revit.UI.DockablePaneId,Autodesk.Revit.UI.DockablePaneId)
Compares two DockablePaneId instances.
first: The first DockablePaneId.
second: The second DockablePaneId.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.UI.DockablePaneId.op_Equality(Autodesk.Revit.UI.DockablePaneId,Autodesk.Revit.UI.DockablePaneId)
Compares two DockablePaneId instances.
first: The first DockablePaneId.
second: The second DockablePaneId.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.UI.DockablePaneId.#ctor(System.Guid)
Creates a new DockablePaneId instance.
guid: The identifier for the DockablePaneId.

Autodesk.Revit.UI.DockablePaneId
Identifier for a pane that participates in the Revit docking window system.
Since:
2014